app/Controllers/CtrlUsuariosTabla.php

SELECT *
FROM `clientes`
WHERE `curp` = 'PAZC010106HYNNLRA6'
 LIMIT 1
---
    public function index($curpCliente = '')
    {
        if ($curpCliente) {
            $cliente = new Cliente();

            $data = $cliente->where('curp', $curpCliente)->first();

INSERT INTO `cuentas` (`clienteId`, `id`, `saldo`, `vencimiento`) VALUES ('2', 4591108835020222, 0, '28/08')
---
    public function agregarCuenta(){
        $clienteId = $this->request->getPost();
        $response = [
            'message' =>'La cuenta ha sido agregada',
            'type' => 'success',
        ];

        $cuenta = new Cuenta();

        try {
            $cuenta->insert($clienteId);