app/Controllers/CtrlUsuariosRegistro.php

SELECT *
FROM `clientes`
WHERE `id` = '4'
 LIMIT 1
---
    public function index($clienteId = 0)
    {
       if (!$clienteId) {
            return view('cliente/registro');
        } else if (is_numeric($clienteId)) {
            $cliente = new Cliente();
            $datosCliente = $cliente->where('id', $clienteId)->first();