app/Controllers/CtrlUsuariosReporte.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $cliente = new Cliente();

        $result = $cliente->findAll();