app/Models/Cliente.php

SELECT *
FROM `cuentas`
WHERE `clienteId` = '4'
---
    protected function obtenerCuentas(array $data)
    {
        if ($data['method'] === 'first') {
            $cuenta = new Cuenta();

            if (isset($data["data"]['id'])) {
                $data['data']['cuentas'] = $cuenta->where('clienteId', $data['data']["id"])->findAll();